function [x, it] = testePI_PC(op, A, b, c)

if op == 1
    % ============= TESTE 1 ==================
     A = [1 1 1 0 0; 
         2 1 0 1 0; 
         5 10 0 0 1];
     b = [100 150 800]';
     c = [-80 -60 0 0 0]';
     x = [10 10 80 120 650]';
     lamb = [0; 0; 0];
     mu = [1/10; 1/10; 1/80; 1/120;1/650];
     %sem grafico
     [x, it] = PIPL_PC(A, b, c, x, lamb, mu);
     %com gráfico
     %[x, it] = PI_PC(A, b, c, x, lamb, mu, 1);
     % SOLUÇÃO FINAL: x = (50 50 0 0 50), f = 7000
end
if op == 2
    % ============= TESTE 2 ==================
    A = [-2 1 1 0 0;
        -1 2 0 1 0;
        1 0 0 0 1];
    b = [2 7 3]';
    c = [-1 -2 0 0 0]';
    x = [10 10 2 7 3]';
    lamb = [0; 0; 0];
    mu = [1; 1; 1; 1; 1];
    %sem grafico
     [x, it] = PIPL_PC(A, b, c, x, lamb, mu);
     %com gráfico
     %[x, it] = PIPL_PC(A, b, c, x, lamb, mu, 1);
    %SOLUÇÃO FINAL: x = (3 5 3 0 0) f = -13
    %=========================================   
end
if op == 3
    % ============= TESTE 3 ==================
    A = [2 1 1 1 0 0; 
        1 2 3 0 1 0; 
        2 2 1 0 0 1];
    b = [2 5 6]';
    c = [-3 -1 -3 0 0 0]';
    x = [10 10 10 2 5 6]';
    lamb = [0; 0; 0];
    mu = [1/10; 1/10; 1/2; 1/7; 1/3];
    [x, it] = PIPL_PC(A, b, c, x, lamb, mu);
    %SOLUÇÃO FINAL: x = (0.2 0 1.6 0 0 4) f = -5.4
    %=========================================   
end